HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxHspdm_bf.h
/**
 * \file IfxHspdm_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Hspdm_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Hspdm_Registers
 * 
 */
#ifndef IFXHSPDM_BF_H
#define IFXHSPDM_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Hspdm_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_HSPDM_CLC_Bits.DISR */
#define IFX_HSPDM_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CLC_Bits.DISR */
#define IFX_HSPDM_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CLC_Bits.DISR */
#define IFX_HSPDM_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_HSPDM_CLC_Bits.DISS */
#define IFX_HSPDM_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CLC_Bits.DISS */
#define IFX_HSPDM_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CLC_Bits.DISS */
#define IFX_HSPDM_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_HSPDM_CLC_Bits.EDIS */
#define IFX_HSPDM_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CLC_Bits.EDIS */
#define IFX_HSPDM_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CLC_Bits.EDIS */
#define IFX_HSPDM_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_HSPDM_ID_Bits.MODREV */
#define IFX_HSPDM_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_HSPDM_ID_Bits.MODREV */
#define IFX_HSPDM_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_HSPDM_ID_Bits.MODREV */
#define IFX_HSPDM_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_HSPDM_ID_Bits.MODTYPE */
#define IFX_HSPDM_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_HSPDM_ID_Bits.MODTYPE */
#define IFX_HSPDM_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_HSPDM_ID_Bits.MODTYPE */
#define IFX_HSPDM_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_HSPDM_ID_Bits.MODNUMBER */
#define IFX_HSPDM_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_HSPDM_ID_Bits.MODNUMBER */
#define IFX_HSPDM_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_HSPDM_ID_Bits.MODNUMBER */
#define IFX_HSPDM_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_HSPDM_BUFA0_Bits.STARTA */
#define IFX_HSPDM_BUFA0_STARTA_LEN (13u)

/** \brief Mask for Ifx_HSPDM_BUFA0_Bits.STARTA */
#define IFX_HSPDM_BUFA0_STARTA_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_BUFA0_Bits.STARTA */
#define IFX_HSPDM_BUFA0_STARTA_OFF (0u)

/** \brief Length for Ifx_HSPDM_BUFA0_Bits.ENDA */
#define IFX_HSPDM_BUFA0_ENDA_LEN (13u)

/** \brief Mask for Ifx_HSPDM_BUFA0_Bits.ENDA */
#define IFX_HSPDM_BUFA0_ENDA_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_BUFA0_Bits.ENDA */
#define IFX_HSPDM_BUFA0_ENDA_OFF (16u)

/** \brief Length for Ifx_HSPDM_BUFB0_Bits.STARTB */
#define IFX_HSPDM_BUFB0_STARTB_LEN (13u)

/** \brief Mask for Ifx_HSPDM_BUFB0_Bits.STARTB */
#define IFX_HSPDM_BUFB0_STARTB_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_BUFB0_Bits.STARTB */
#define IFX_HSPDM_BUFB0_STARTB_OFF (0u)

/** \brief Length for Ifx_HSPDM_BUFB0_Bits.ENDB */
#define IFX_HSPDM_BUFB0_ENDB_LEN (13u)

/** \brief Mask for Ifx_HSPDM_BUFB0_Bits.ENDB */
#define IFX_HSPDM_BUFB0_ENDB_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_BUFB0_Bits.ENDB */
#define IFX_HSPDM_BUFB0_ENDB_OFF (16u)

/** \brief Length for Ifx_HSPDM_CURRAD_Bits.CURRAD */
#define IFX_HSPDM_CURRAD_CURRAD_LEN (13u)

/** \brief Mask for Ifx_HSPDM_CURRAD_Bits.CURRAD */
#define IFX_HSPDM_CURRAD_CURRAD_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_CURRAD_Bits.CURRAD */
#define IFX_HSPDM_CURRAD_CURRAD_OFF (0u)

/** \brief Length for Ifx_HSPDM_MUTE0_Bits.START0 */
#define IFX_HSPDM_MUTE0_START0_LEN (13u)

/** \brief Mask for Ifx_HSPDM_MUTE0_Bits.START0 */
#define IFX_HSPDM_MUTE0_START0_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_MUTE0_Bits.START0 */
#define IFX_HSPDM_MUTE0_START0_OFF (0u)

/** \brief Length for Ifx_HSPDM_MUTE0_Bits.END0 */
#define IFX_HSPDM_MUTE0_END0_LEN (13u)

/** \brief Mask for Ifx_HSPDM_MUTE0_Bits.END0 */
#define IFX_HSPDM_MUTE0_END0_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_MUTE0_Bits.END0 */
#define IFX_HSPDM_MUTE0_END0_OFF (16u)

/** \brief Length for Ifx_HSPDM_MUTE1_Bits.START1 */
#define IFX_HSPDM_MUTE1_START1_LEN (13u)

/** \brief Mask for Ifx_HSPDM_MUTE1_Bits.START1 */
#define IFX_HSPDM_MUTE1_START1_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_MUTE1_Bits.START1 */
#define IFX_HSPDM_MUTE1_START1_OFF (0u)

/** \brief Length for Ifx_HSPDM_MUTE1_Bits.END1 */
#define IFX_HSPDM_MUTE1_END1_LEN (13u)

/** \brief Mask for Ifx_HSPDM_MUTE1_Bits.END1 */
#define IFX_HSPDM_MUTE1_END1_MSK (0x1fffu)

/** \brief Offset for Ifx_HSPDM_MUTE1_Bits.END1 */
#define IFX_HSPDM_MUTE1_END1_OFF (16u)

/** \brief Length for Ifx_HSPDM_ADCTG_Bits.OFFSET */
#define IFX_HSPDM_ADCTG_OFFSET_LEN (16u)

/** \brief Mask for Ifx_HSPDM_ADCTG_Bits.OFFSET */
#define IFX_HSPDM_ADCTG_OFFSET_MSK (0xffffu)

/** \brief Offset for Ifx_HSPDM_ADCTG_Bits.OFFSET */
#define IFX_HSPDM_ADCTG_OFFSET_OFF (0u)

/** \brief Length for Ifx_HSPDM_ADCTG_Bits.PERIOD */
#define IFX_HSPDM_ADCTG_PERIOD_LEN (16u)

/** \brief Mask for Ifx_HSPDM_ADCTG_Bits.PERIOD */
#define IFX_HSPDM_ADCTG_PERIOD_MSK (0xffffu)

/** \brief Offset for Ifx_HSPDM_ADCTG_Bits.PERIOD */
#define IFX_HSPDM_ADCTG_PERIOD_OFF (16u)

/** \brief Length for Ifx_HSPDM_ADCTGCNT_Bits.TGCNT */
#define IFX_HSPDM_ADCTGCNT_TGCNT_LEN (16u)

/** \brief Mask for Ifx_HSPDM_ADCTGCNT_Bits.TGCNT */
#define IFX_HSPDM_ADCTGCNT_TGCNT_MSK (0xffffu)

/** \brief Offset for Ifx_HSPDM_ADCTGCNT_Bits.TGCNT */
#define IFX_HSPDM_ADCTGCNT_TGCNT_OFF (0u)

/** \brief Length for Ifx_HSPDM_CON_Bits.EN0 */
#define IFX_HSPDM_CON_EN0_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.EN0 */
#define IFX_HSPDM_CON_EN0_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.EN0 */
#define IFX_HSPDM_CON_EN0_OFF (0u)

/** \brief Length for Ifx_HSPDM_CON_Bits.EN1 */
#define IFX_HSPDM_CON_EN1_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.EN1 */
#define IFX_HSPDM_CON_EN1_MSK (0x1u)

