HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxHspdm_bf.h
/** \brief Offset for Ifx_HSPDM_CON_Bits.EN1 */
#define IFX_HSPDM_CON_EN1_OFF (1u)

/** \brief Length for Ifx_HSPDM_CON_Bits.SM */
#define IFX_HSPDM_CON_SM_LEN (2u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.SM */
#define IFX_HSPDM_CON_SM_MSK (0x3u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.SM */
#define IFX_HSPDM_CON_SM_OFF (2u)

/** \brief Length for Ifx_HSPDM_CON_Bits.PAC */
#define IFX_HSPDM_CON_PAC_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.PAC */
#define IFX_HSPDM_CON_PAC_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.PAC */
#define IFX_HSPDM_CON_PAC_OFF (4u)

/** \brief Length for Ifx_HSPDM_CON_Bits.ITMDIV */
#define IFX_HSPDM_CON_ITMDIV_LEN (2u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.ITMDIV */
#define IFX_HSPDM_CON_ITMDIV_MSK (0x3u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.ITMDIV */
#define IFX_HSPDM_CON_ITMDIV_OFF (5u)

/** \brief Length for Ifx_HSPDM_CON_Bits.MM */
#define IFX_HSPDM_CON_MM_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.MM */
#define IFX_HSPDM_CON_MM_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.MM */
#define IFX_HSPDM_CON_MM_OFF (7u)

/** \brief Length for Ifx_HSPDM_CON_Bits.RUN */
#define IFX_HSPDM_CON_RUN_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.RUN */
#define IFX_HSPDM_CON_RUN_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.RUN */
#define IFX_HSPDM_CON_RUN_OFF (8u)

/** \brief Length for Ifx_HSPDM_CON_Bits.MPOL */
#define IFX_HSPDM_CON_MPOL_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.MPOL */
#define IFX_HSPDM_CON_MPOL_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.MPOL */
#define IFX_HSPDM_CON_MPOL_OFF (9u)

/** \brief Length for Ifx_HSPDM_CON_Bits.ADCTGEN */
#define IFX_HSPDM_CON_ADCTGEN_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.ADCTGEN */
#define IFX_HSPDM_CON_ADCTGEN_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.ADCTGEN */
#define IFX_HSPDM_CON_ADCTGEN_OFF (10u)

/** \brief Length for Ifx_HSPDM_CON_Bits.DITH */
#define IFX_HSPDM_CON_DITH_LEN (3u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.DITH */
#define IFX_HSPDM_CON_DITH_MSK (0x7u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.DITH */
#define IFX_HSPDM_CON_DITH_OFF (11u)

/** \brief Length for Ifx_HSPDM_CON_Bits.RUNC */
#define IFX_HSPDM_CON_RUNC_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.RUNC */
#define IFX_HSPDM_CON_RUNC_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.RUNC */
#define IFX_HSPDM_CON_RUNC_OFF (16u)

/** \brief Length for Ifx_HSPDM_CON_Bits.RUNS */
#define IFX_HSPDM_CON_RUNS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.RUNS */
#define IFX_HSPDM_CON_RUNS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.RUNS */
#define IFX_HSPDM_CON_RUNS_OFF (17u)

/** \brief Length for Ifx_HSPDM_CON_Bits.HREN */
#define IFX_HSPDM_CON_HREN_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.HREN */
#define IFX_HSPDM_CON_HREN_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.HREN */
#define IFX_HSPDM_CON_HREN_OFF (18u)

/** \brief Length for Ifx_HSPDM_CON_Bits.HRAE */
#define IFX_HSPDM_CON_HRAE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.HRAE */
#define IFX_HSPDM_CON_HRAE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.HRAE */
#define IFX_HSPDM_CON_HRAE_OFF (19u)

/** \brief Length for Ifx_HSPDM_CON_Bits.HRSEL */
#define IFX_HSPDM_CON_HRSEL_LEN (1u)

/** \brief Mask for Ifx_HSPDM_CON_Bits.HRSEL */
#define IFX_HSPDM_CON_HRSEL_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_CON_Bits.HRSEL */
#define IFX_HSPDM_CON_HRSEL_OFF (20u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.BAS */
#define IFX_HSPDM_FLAGS_BAS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.BAS */
#define IFX_HSPDM_FLAGS_BAS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.BAS */
#define IFX_HSPDM_FLAGS_BAS_OFF (0u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.BAE */
#define IFX_HSPDM_FLAGS_BAE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.BAE */
#define IFX_HSPDM_FLAGS_BAE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.BAE */
#define IFX_HSPDM_FLAGS_BAE_OFF (1u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.BBS */
#define IFX_HSPDM_FLAGS_BBS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.BBS */
#define IFX_HSPDM_FLAGS_BBS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.BBS */
#define IFX_HSPDM_FLAGS_BBS_OFF (2u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.BBE */
#define IFX_HSPDM_FLAGS_BBE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.BBE */
#define IFX_HSPDM_FLAGS_BBE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.BBE */
#define IFX_HSPDM_FLAGS_BBE_OFF (3u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M0S */
#define IFX_HSPDM_FLAGS_M0S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M0S */
#define IFX_HSPDM_FLAGS_M0S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M0S */
#define IFX_HSPDM_FLAGS_M0S_OFF (4u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_OFF (5u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_OFF (6u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_OFF (7u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_OFF (8u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_OFF (9u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_OFF (0u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BAE */
#define IFX_HSPDM_FLAGSSET_BAE_LEN (1u)

